//CRIESTR  JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//*
//* JCL PARA CRIAR ESTRUTURA DE DATASETS DO PROJETO
//*
//CREPDS1  EXEC PGM=IEFBR14
//*
//* CRIA PDS PARA ARQUIVOS DE ENTRADA
//*
//DD1      DD DSN=&SYSUID..PDS.INPUT,
//            DISP=(NEW,CATLG,DELETE),
//            DSORG=PO,
//            SPACE=(TRK,(1,1,5)),
//            RECFM=FB,LRECL=80,BLKSIZE=3120
//*
//CREPDS2  EXEC PGM=IEFBR14
//*
//* CRIA PDS PARA ARQUIVOS DE SAÍDA
//*
//DD1      DD DSN=&SYSUID..PDS.SAIDA,
//            DISP=(NEW,CATLG,DELETE),
//            DSORG=PO,
//            SPACE=(TRK,(1,1,5)),
//            RECFM=FB,LRECL=80,BLKSIZE=3120
//*
//CRESEQ  EXEC PGM=IEFBR14
//*
//* CRIA DATASET SEQUENCIAL PARA LOGS
//*
//DD1      DD DSN=&SYSUID..PROJETO.LOG,
//            DISP=(NEW,CATLG,DELETE),
//            DSORG=PS,
//            SPACE=(TRK,(1,1)),
//            RECFM=FB,LRECL=133,BLKSIZE=13300