//CRIADAD  JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//*
//* JCL PARA CRIAR DADOS DE EXEMPLO NOS PDSS
//*
//CRIARQ1  EXEC PGM=IEBGENER
//SYSUT1   DD *
DADOS DO ARQUIVO 1 - LINHA 1
DADOS DO ARQUIVO 1 - LINHA 2
DADOS DO ARQUIVO 1 - LINHA 3
/*
//SYSUT2   DD DSN=&SYSUID..PDS.INPUT(ARQ1),
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//*
//CRIARQ2  EXEC PGM=IEBGENER
//SYSUT1   DD *
DADOS DO ARQUIVO 2 - LINHA 1  
DADOS DO ARQUIVO 2 - LINHA 2
DADOS DO ARQUIVO 2 - LINHA 3
/*
//SYSUT2   DD DSN=&SYSUID..PDS.INPUT(ARQ2),
//            DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY